app/controllers/tasks_controller.rb

SELECT * FROM [tasks]
---
  def load
    @xresponse.result = {
      :data => Task.all.collect {|u| u.to_record}

INSERT INTO [tasks] ([updated_at], [title], [description], [user_id], [created_at]) VALUES('2009-11-08 23:16:24.562', 'New task', 'this is a new task', 3, '2009-11-08 23:16:24.562')
---
  def create
    data = params["data"] || params
    t = Task.create(data)

SELECT * FROM [tasks] WHERE ([tasks].[id] = 1)
DELETE FROM [tasks] WHERE [id] = 1
---
  def destroy
    t = Task.find(params["id"])
    t.destroy