app/controllers/users_controller.rb

SELECT * FROM [users]
---
     def index
        rs = User.all.collect {|u| u.to_record}

INSERT INTO [users] ([updated_at], [last], [first], [email], [created_at]) VALUES('2009-11-08 22:48:54.937', 'test', 'test', 'test@test.com', '2009-11-08 22:48:54.937')
---
    def create
        u = User.create(params["data"])

SELECT * FROM [users] WHERE ([users].[id] = 2)
DELETE FROM [users] WHERE [id] = 2
---
    def destroy
        u = User.find(params[:id])
        render(:text => '', :status => (u.destroy) ? 204 : 500)